4545616abcgd/agent-/application/edge_agent/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_8MB.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x9000
# end of Partition Table

#
# HTTP Client Reuse
#
CONFIG_HTTP_REUSE_ENABLE=y
# end of HTTP Client Reuse

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

#
# NimBLE Options
#

#
# Roles and Profiles
#
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
# end of Roles and Profiles

#
# Security (SMP)
#
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_BONDS=2
# end of Security (SMP)

#
# GAP
#
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=2
# end of GAP

#
# GATT / ATT
#
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=64
CONFIG_BT_NIMBLE_ATT_MAX_PREP_ENTRIES=15
# end of GATT / ATT

#
# Memory Settings
#
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=6
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=15
# end of Memory Settings

#
# BLE 5.x Features
#
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
# end of BLE 5.x Features

#
# Extra Features
#
CONFIG_BT_NIMBLE_DYNAMIC_SERVICE=y
# end of Extra Features

#
# Debugging/Testing
#
CONFIG_BT_NIMBLE_PRINT_ERR_NAME=n
# end of Debugging/Testing
# end of NimBLE Options

#
# Controller Options
#
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_CTRL_ADV_DUP_FILT_MAX=1
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=n
CONFIG_BT_CTRL_BLE_SCAN_DUPL=n
# end of Controller Options

#
# Common Options
#
CONFIG_BT_ALARM_MAX_NUM=20
# end of Common Options
# end of Bluetooth

#
# ADC and ADC Calibration
#
CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM=y
CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE=y
CONFIG_ADC_CONTINUOUS_FORCE_USE_ADC2_ON_C3_S3=y
CONFIG_ADC_ENABLE_DEBUG_LOG=y
# end of ADC and ADC Calibration

#
# Wireless Coexistence
#
CONFIG_ESP_COEX_POWER_MANAGEMENT=y
CONFIG_ESP_COEX_GPIO_DEBUG=y
# end of Wireless Coexistence

#
# ESP-Driver:I2C Configurations
#
CONFIG_I2C_ISR_IRAM_SAFE=y
CONFIG_I2C_ENABLE_DEBUG_LOG=y
CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION_2=y
# end of ESP-Driver:I2C Configurations

#
# ESP-Driver:I2S Configurations
#
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_I2S_ENABLE_DEBUG_LOG=y
# end of ESP-Driver:I2S Configurations

#
# ESP-Driver:MCPWM Configurations
#
CONFIG_MCPWM_ISR_CACHE_SAFE=y
CONFIG_MCPWM_CTRL_FUNC_IN_IRAM=y
CONFIG_MCPWM_ENABLE_DEBUG_LOG=y
# end of ESP-Driver:MCPWM Configurations

#
# ESP-Driver:UART Configurations
#
CONFIG_UART_ISR_IN_IRAM=y
# end of ESP-Driver:UART Configurations

#
# ESP-Driver:UHCI Configurations
#
CONFIG_UHCI_ISR_CACHE_SAFE=y
CONFIG_UHCI_ENABLE_DEBUG_LOG=y
# end of ESP-Driver:UHCI Configurations

#
# Ethernet
#
CONFIG_ETH_USE_OPENETH=y
CONFIG_ETH_TRANSMIT_MUTEX=y
# end of Ethernet

#
# HTTP Server
#
CONFIG_HTTPD_WS_SUPPORT=y
# end of HTTP Server

#
# ESP System Settings
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# end of Wi-Fi

#
# FAT Filesystem support
#
CONFIG_FATFS_VOLUME_COUNT=3
CONFIG_FATFS_LFN_HEAP=y
# end of FAT Filesystem support

#
# FreeRTOS
#

#
# Kernel
#
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Keep task stacks in internal RAM.
# External task stacks can be unsafe while flash/NVS temporarily disables cache.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=n
# end of Kernel
# end of FreeRTOS

#
# LWIP
#
CONFIG_LWIP_LOCAL_HOSTNAME="esp-claw"
CONFIG_LWIP_MAX_SOCKETS=20
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

#
# SNTP
#
CONFIG_LWIP_SNTP_MAX_SERVERS=2
# end of SNTP
# end of LWIP

#
# mbedTLS
#
CONFIG_MBEDTLS_HARDWARE_AES=n

# Put mbedTLS dynamic allocations in PSRAM to preserve scarce internal DRAM
# for task stacks, Wi-Fi, NVS/flash-safe code paths, and future audio work.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=n
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=n
CONFIG_MBEDTLS_CUSTOM_MEM_ALLOC=n
# end of mbedTLS

#
# ESP-MQTT Configurations
#
CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED=y
# end of ESP-MQTT Configurations

#
# TCP Transport
#

#
# Websocket
#
CONFIG_WS_BUFFER_SIZE=4096
CONFIG_WS_DYNAMIC_BUFFER=y
# end of Websocket
# end of TCP Transport

#
# Virtual file system
#
CONFIG_VFS_MAX_COUNT=12
# end of Virtual file system

#
# ESP-Claw Core
#
CONFIG_CLAW_CORE_STAGE_VERBOSITY_VERBOSE=y
# end of ESP-Claw Core

#
# Claw Skill
#
CONFIG_CLAW_SKILL_DEBUG_LOG=y
# end of Claw Skill

#
# App Claw Config
#

#
# App Claw Lua Modules
#
CONFIG_APP_CLAW_LUA_MODULE_AUDIO=y
CONFIG_APP_CLAW_LUA_MODULE_CAMERA=y
CONFIG_APP_CLAW_LUA_MODULE_FUEL_GAUGE=y
CONFIG_APP_CLAW_LUA_MODULE_IMU=y
CONFIG_APP_CLAW_LUA_MODULE_IR=y
CONFIG_APP_CLAW_LUA_MODULE_KNOB=y
CONFIG_APP_CLAW_LUA_MODULE_MAGNETOMETER=y
CONFIG_APP_CLAW_LUA_MODULE_SCI=y
# end of App Claw Lua Modules
# end of App Claw Config

#
# LVGL configuration
#

#
# Memory Settings
#
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# end of Memory Settings

#
# 3rd Party Libraries
#
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
# end of 3rd Party Libraries
# end of LVGL configuration
# end of Component config

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_MODEL_IN_FLASH=y
# CONFIG_SR_WN_WN9S_HIESP is not set
# CONFIG_SR_WN_WN9S_NIHAOXIAOZHI is not set
CONFIG_SR_WN_WN9_NIHAOXIAOYI_TTS2=y
# CONFIG_APP_CLAW_CAP_IM_QQ is not set
# CONFIG_APP_CLAW_CAP_IM_FEISHU is not set
# CONFIG_APP_CLAW_CAP_IM_TG is not set
# CONFIG_APP_CLAW_CAP_IM_WECHAT is not set
